{
  "header": {
    "siteTitle": "Sing Chan"
  },
  "projectCard": {
    "viewProject": "Afficher le projet",
    "imageAlt": "Image du projet",
    "tags": "Balises",
    "year": "Année"
  },
  "projectGallery": {
    "openImage": "Ouvrir dans la visionneuse",
    "closeImage": "Fermer la visionneuse",
    "previousImage": "Image précédente",
    "nextImage": "Image suivante"
  },
  "projectLightbox": {
    "ariaLabel": "Galerie d'images",
    "closeButton": "Fermer la galerie",
    "previousButton": "Image précédente",
    "nextButton": "Image suivante"
  },
  "loadMoreButton": {
    "loading": "Chargement des projets...",
    "loadMore": "Charger plus de projets",
    "allLoaded": "Tous les projets chargés",
    "loadingAria": "Chargement de plus de projets",
    "loadMoreCountAria": "Charger {{remainingCount}} projets supplémentaires"
  },
  "videoEmbed": {
    "vimeoPlayer": "Lecteur vidéo Vimeo",
    "youtubePlayer": "Lecteur vidéo YouTube"
  },
  "asyncProjectsList": {
    "loadingError": "Erreur lors du chargement des projets"
  },
  "frenchTranslationAlert": {
    "title": "Traduction automatique",
    "message": "Toutes les chaînes ont été traduites automatiquement. Le français est présent comme démonstration des capacités de localisation de cette application."
  },
  "colophon": {
    "butaStory": {
      "heading": "L'histoire de Buta"
    },
    "designPhilosophy": {
      "heading": "Conception et typographie",
      "colorPaletteHeading": "Palette de couleurs",
      "typographyHeading": "Typographie",
      "googleFontsAriaLabel": "Voir {{name}} sur Google Fonts (ouvre un nouvel onglet)"
    },
    "technologiesShowcase": {
      "heading": "Technologies",
      "categoryLabels": {
        "0": "Cadre et environnement d'exécution",
        "1": "Interface utilisateur et style",
        "2": "Outils de développement",
        "3": "Tests"
      },
      "v1SectionHeading": "Original V1 Technologies (Historique)",
      "v1Description": "Le site original du portefeuille a été construit avec ces technologies :",
      "visitWebsiteAriaLabel": "Visitez le site web de {{name}} (s'ouvre dans un nouvel onglet)"
    }
  },
  "resume": {
    "header": {
      "tagline": "Je développe des applications utiles, intuitives et attrayantes qui améliorent la vie des gens.",
      "downloadLabel": "Download Résumé"
    },
    "workExperience": {
      "heading": "Expérience professionnelle",
      "keyContributions": "Contributions clés :",
      "collabware": {
        "description": "En tant que vice-président des produits, j'étais chargé de diriger la mise en œuvre des solutions de collaboration d'entreprise de Collabware. J'ai dirigé des équipes interfonctionnelles chargées de l'expérience utilisateur et de l'assurance qualité, et j'ai intégré les opérations et l'ingénierie cloud afin de fournir des fonctionnalités centrées sur le client tout en optimisant l'efficacité opérationnelle.",
        "contributions": [
          "Recueil des exigences auprès des clients et des parties prenantes, traduction des besoins commerciaux en fonctionnalités produit exploitables et en priorités pour la feuille de route",
          "Collaborer avec les équipes d'ingénieurs à la définition du backlog produit et à la planification des sprints.",
          "Gérer l'équipe d'assurance qualité afin de développer des cas de test complets et des cadres d'automatisation pour maintenir les normes de qualité des produits.",
          "Collaborez avec les opérations cloud pour surveiller la santé du système et garantir la fiabilité de la plateforme.",
          "A mené une initiative d'optimisation des coûts grâce à des audits systématiques de l'infrastructure cloud, identifiant ainsi d'importantes possibilités de réduction des dépenses.",
          "Responsable de la conception interactive, de l'expérience utilisateur et des cadres de développement front-end pour les offres logicielles de Collabware.",
          "Encadrer les développeurs UX, favoriser l'excellence en matière de conception et la collaboration interfonctionnelle",
          "Concevoir et mettre en œuvre un programme d'intégration sur la connaissance des produits pour les nouveaux membres de l'équipe Collabware."
        ]
      },
      "habanero": {
        "description": "Embauché comme premier développeur d'expérience utilisateur au sein de l'organisation afin de combler les problèmes de communication et de processus entre les équipes de conception et de développement. J'ai fait connaître la valeur du rôle de développeur UX au sein de Habanero et j'ai introduit des processus et des modèles de développement front-end afin d'éliminer les points faibles dans le cycle de vie des projets. J'ai accueilli et encadré les nouveaux développeurs UX lorsqu'ils ont rejoint Habanero. J'ai contribué à porter à huit le nombre de développeurs front-end chez Habanero et j'ai également assumé des responsabilités en matière de gestion de groupe et de ressources."
      },
      "danielChoi": {
        "description": "Contraté pour gérer et diriger le développement de projets interactifs, depuis la couche base de données jusqu'à l'interface utilisateur, y compris la sécurité, les tests, le déploiement et la documentation."
      },
      "localLola": {
        "description": "Contrat pour développer des applications Flash, des scripts côté client et des balises XHTML/CSS pour les projets LLDT. Consultation sur la conception d'interfaces et assistance à la programmation pour le développement de CustomBlox, la solution CMS ASP.Net de LLDT."
      },
      "greyAdvertising": {
        "description": "Développement de grASP, un CMS interne modulaire et extensible utilisé dans le cadre des projets Grey de 2001 à 2006. Développement et maintenance des sites Web et applications externes et internes de Grey. Prise en charge du rôle de producteur interactif, avec des tâches supplémentaires de gestion de projet telles que la gestion des ressources et des calendriers de projet, l'interaction et la coordination avec les développeurs externes, les fournisseurs et les clients."
      },
      "companies": {
        "collabware": {
          "roles": [
            {
              "title": "VP, Produit",
              "startDate": "Mai 2020",
              "endDate": "Actuel"
            },
            {
              "title": "Gestionnaire de produit",
              "startDate": "Mars 2018",
              "endDate": "Mai 2020"
            },
            {
              "title": "Architecte d'expérience utilisateur",
              "startDate": "Août 2011",
              "endDate": "Actuel"
            }
          ]
        },
        "habanero": {
          "roles": [
            {
              "title": "Développeur d'expérience utilisateur",
              "startDate": "Mai 2006",
              "endDate": "Juillet 2011"
            }
          ]
        },
        "danielChoi": {
          "roles": [
            {
              "title": "Développeur principal (contrat)",
              "startDate": "2005",
              "endDate": "2006"
            }
          ]
        },
        "localLola": {
          "roles": [
            {
              "title": "Développeur Flash et d'expérience utilisateur (contrat)",
              "startDate": "2003",
              "endDate": "2006"
            }
          ]
        },
        "greyAdvertising": {
          "roles": [
            {
              "title": "Producteur/Développeur interactif",
              "startDate": "Juillet 1999",
              "endDate": "Mai 2006"
            }
          ]
        }
      }
    },
    "skills": {
      "coreCompetencies": "Compétences clés",
      "everydayTools": "Outils quotidiens",
      "onceInAWhile": "De temps en temps"
    },
    "clients": {
      "heading": "Clients"
    },
    "conferenceSpeaker": {
      "heading": "Conférencier",
      "intro": "J'ai présenté des sessions lors des conférences suivantes :"
    }
  }
}
