{
  "projects": {
    "collabspaceDownloader": {
      "title": "Collabware - Téléchargeur d'exportation Collabspace",
      "desc": "<p>Collabspace Export Downloader est une application de bureau qui permet aux utilisateurs de télécharger et de gérer en toute sécurité les exportations Collabspace dans plusieurs régions.</p><p>Les utilisateurs peuvent suspendre, reprendre ou annuler les téléchargements avec persistance d'état après les redémarrages, tandis que le suivi de la progression affiche le statut en temps réel. Les liens profonds via les protocoles de liens magnétiques permettent aux utilisateurs de lancer des téléchargements directement à partir de sources externes telles que les e-mails ou Teams.</p><p>Conçu sur .NET 9 et MAUI 9, le téléchargeur met l'accent sur l'accessibilité avec la conformité WCAG 2.2 niveau AA, y compris la navigation au clavier et la prise en charge des lecteurs d'écran. Il offre une localisation en quatre langues et une gestion intégrée des mises à jour automatiques.</p><p>Le calendrier de ce projet était extrêmement court et l'application a été planifiée, développée et testée par moi-même à l'aide de Claude Code en l'espace d'un mois.</p>",
      "circa": "Hiver 2025",
      "images": [
        "Export Downloader - Progression du téléchargement (mode clair)",
        "Export Downloader - Progression du téléchargement (mode sombre)",
        "Export Downloader - Boîte de dialogue de mise à jour automatique",
        "Export Downloader - Paramètres"
      ]
    },
    "collabspace": {
      "title": "Collabware - Espace collaboratif",
      "desc": "<p>Collabspace est une solution d'automatisation de la gestion des archives basée sur le cloud et certifiée FedRAMP qui automatise les activités de conformité afin de répondre aux exigences législatives et réglementaires.</p><p>La plateforme utilise un système de workflow visuel sans code pour concevoir des politiques de conservation et de cycle de vie, prenant en charge à la fois la conservation basée sur le temps et sur les événements grâce à des calculs basés sur les métadonnées.</p><p>Elle gère à la fois le contenu électronique (e-mails, données structurées et non structurées) et les archives physiques grâce à des fonctionnalités de contrôle des stocks, de suivi de la circulation, de gestion des conteneurs et de codes-barres.</p><p>Collabspace prend en charge les processus de révision de la destruction en plusieurs étapes afin d'autoriser la destruction des documents, avec des déclencheurs basés sur les événements pour la conservation et la destruction.</p>",
      "circa": "Automne 2017 - présent",
      "images": [
        "Collabspace - Analyses",
        "Collabspace - Aperçus des e-mails avec navigation par fil",
        "Collabspace - Concepteur visuel de flux de travail",
        "Collabspace - Aperçu des documents avec OCR",
        "Collabspace - Concepteur de schémas agrégés",
        "Collabspace - Générateur de recherche avancée",
        "Collabspace - Plan de classement et politique de conformité",
        "Collabspace - Bibliothèque de documents physiques"
      ]
    },
    "collabmail": {
      "title": "Collabware - Collabmail",
      "desc": "<p>Collabmail est un complément Microsoft Outlook qui intègre SharePoint directement dans Outlook, offrant une fonctionnalité glisser-déposer pour classer les e-mails et les pièces jointes dans SharePoint sans changer d'application.</p><p>Il prend en charge SharePoint Server et SharePoint Online, permettant aux utilisateurs d'accéder aux bibliothèques, de consulter le contenu, les dossiers et les métadonnées depuis leur boîte de réception.</p><p>Les utilisateurs peuvent glisser-déposer des e-mails, des pièces jointes ou les deux vers SharePoint en masse, et peuvent également ajouter du contenu SharePoint à des e-mails sous forme de pièces jointes ou de liens.</p><p>Collabmail garantit la conformité en invitant les utilisateurs à fournir les métadonnées requises lors du classement du contenu, une fonctionnalité indisponible dans Outlook standard, avec des capacités d'édition en masse pour réduire la saisie répétitive de données.</p><p>Parmi les fonctionnalités supplémentaires, citons la recherche de fichiers SharePoint à partir d'Outlook, la capture automatique des métadonnées des e-mails et une liste de favoris pour un accès rapide à la bibliothèque.</p>",
      "circa": "Été 2016 - présent",
      "images": [
        "Collabmail - Ajouter des pièces jointes ou des liens partagés à partir de SharePoint",
        "Collabmail - Glisser-déposer des documents depuis Windows vers SharePoint",
        "Collabmail - Mettre à jour les métadonnées du contenu SharePoint directement dans Outlook",
        "Collabmail - Naviguer et rechercher du contenu SharePoint dans Outlook"
      ]
    },
    "collabwareCLM": {
      "title": "Collabware - Gestion du cycle de vie du contenu (CLM)",
      "desc": "<p>Collabware CLM est une solution certifiée DoD 5015.2 qui s'intègre nativement à SharePoint Server, fournissant une classification, une conservation et une élimination automatisées du contenu grâce à des règles configurées de manière centralisée et appliquées à l'échelle mondiale dans SharePoint.</p><p>La solution comprend un système d'agrégats pour la gestion des dossiers, des workflows visuels du cycle de vie pour les comportements de contenu complexes et un système de requête de contenu global pour les recherches avancées de métadonnées avec tri et filtrage en mode grille.</p><p>Elle dispose d'un système de révision des dispositions en masse géré automatiquement avec des règles de révision prédéfinies ou dynamiques.</p><p>CLM gère les enregistrements physiques, électroniques et par e-mail grâce à des fonctionnalités intégrées de gestion des dossiers, de workflows et de recherche afin de garantir la conformité réglementaire et légale.</p><p>La solution utilise une expérience de glisser-déposer sans code qui ne nécessite aucune nouvelle infrastructure tout en restant transparente pour les utilisateurs.</p>",
      "circa": "Été 2011 - présent",
      "images": [
        "CLM - Bibliothèque de documents physiques",
        "CLM - Gestion des catégories de documents",
        "CLM - Liste d'approbation des dispositions",
        "CLM - Saisie de texte multilingue",
        "CLM - Boîte de dialogue Détails du cycle de vie",
        "CLM - Storyboarding",
        "CLM - Esquisses pour l'interface utilisateur mobile",
        "CLM - Récits d'utilisateurs"
      ]
    },
    "vcInsite": {
      "title": "Vancity - Insite",
      "desc": "<p>Insite est le portail destiné aux employés de Vancity, la plus grande coopérative de crédit du Canada.</p><p>Ce portail est conçu pour impliquer les employés, améliorer leur sens des affaires et leur fournir un accès facile aux informations sur les produits et services afin de les aider à mieux servir les membres.</p><p>Le contenu est regroupé et présenté par thème, ce qui permet aux employés en contact direct avec les membres d'accéder rapidement aux informations dont ils ont le plus souvent besoin.</p><p>Ces informations sont fournies dans le même ton convivial, accessible et conversationnel que celui utilisé par le personnel lors de ses interactions avec les membres.</p><p>Insite a été finaliste des IMPACT Awards 2011 du Microsoft Partner Network dans la catégorie Portails et collaboration.</p><p>Insite a également reçu une mention honorable des Intranet Innovation Awards pour son outil de recherche Search Find-o-meter.</p>",
      "circa": "Automne 2010",
      "images": [
        "Insite - Page d'accueil",
        "Insite - Au service des membres Maquette",
        "Insite - Résultats de recherche",
        "Insite - Profil des employés"
      ]
    },
    "servusCafe": {
      "title": "Servus Credit Union - café",
      "desc": "<p><em>café</em> est une solution de crowdsourcing conçue pour permettre aux employés de participer à un dialogue ouvert visant à améliorer l'organisation et à créer un sentiment de communauté au sein de Servus.</p><p>Les employés ont la possibilité de poser anonymement des questions qui les intéressent, et les autres peuvent évaluer et répondre à ces questions.</p><p><em>café</em> permet également à l'équipe de direction de répondre aux meilleures idées et de déplacer les éléments appropriés dans une zone de notes séparée.</p><p>L'équipe de direction peut communiquer sur l'état d'avancement de chaque idée notée et les employés peuvent continuer à commenter ces éléments, ce qui favorise une collaboration accrue entre l'équipe de direction et les employés de l'organisation.</p><p>Habanero Consulting Group a reçu le prix « Portals and Collaboration Solution of the Year » (Solution de portail et de collaboration de l'année) lors des Microsoft Partner Network IMPACT Awards 2010 pour son travail sur <em>café</em>.</p>",
      "circa": "Printemps 2010",
      "images": [
        "café - Maquette de la page des publications",
        "café - Maquette de la boîte de dialogue « Nouveau message »"
      ]
    },
    "devon": {
      "title": "Devon Energy - Strata",
      "desc": "<p>Au cours de l'été 2009, Devon Energy a mis à jour son portail destiné aux employés, passant de fichiers HTML plats et d'un ensemble d'applications Web différentes à une plateforme SharePoint 2007 unifiée.</p><p>L'un des objectifs du projet était que Habanero forme l'équipe de développement interne de Devon au développement SharePoint afin qu'elle puisse continuer à développer le portail de manière autonome après son lancement initial.</p><p>Pendant six mois, l'équipe mixte a travaillé sur trois fuseaux horaires différents.</p><p>Les développeurs de Habanero à Vancouver ont été associés à des développeurs de Devon, basés à Oklahoma City, Houston et Calgary.</p><p>J'ai personnellement travaillé avec deux développeurs de Devon et les ai formés sur des sujets tels que les meilleures pratiques de développement SharePoint, la personnalisation de SharePoint, jQuery et les techniques avancées HTML/CSS.</p>",
      "circa": "Été/automne 2009",
      "images": [
        "Strata - Maquette de la page d'accueil",
        "Strata - Outils et rapports Maquette",
        "Strata - Maquette du site de collaboration de l'équipe",
        "Strata - Maquette du profil utilisateur"
      ]
    },
    "spMisc": {
      "title": "Autres projets SharePoint 2007 et 2010",
      "desc": "<p>Ce sont des captures d'écran et/ou des maquettes pour d'autres projets SharePoint 2007 et 2010 auxquels j'ai participé.</p>",
      "circa": "2006 - 2012",
      "images": [
        "Collabware - Site Web externe - Été 2010",
        "FortisBC - Site Web externe - Hiver 2010",
        "BC Hydro - Extranet des gestionnaires de l'énergie - Hiver 2009",
        "Association canadienne des producteurs pétroliers - Site Web externe - Été 2008",
        "Ville de Calgary - Portail des employés - Printemps 2008",
        "GoldCorp - Intranet de l'entreprise - Automne 2007",
        "Comptables généraux accrédités du Canada - PDNet - Automne 2007"
      ]
    },
    "habExternal": {
      "title": "Habanero Consulting Group - Site Web externe",
      "desc": "<p>Le site Web externe de Habanero présentait l'expérience et les connaissances de Habanero en matière de personnalisation de SiteFinity.</p><p>L'utilisation de fenêtres modales pour mettre en évidence et naviguer parmi les informations connexes en fonction du champ défini par l'auteur, sans que l'utilisateur ne perde le contexte d'origine, constituait un concept d'interface utilisateur intéressant.</p>",
      "circa": "Hiver 2008",
      "images": [
        "HabaneroConsulting.com - Page d'accueil",
        "HabaneroConsulting.com - Galerie de projets",
        "HabaneroConsulting.com - Modalité du projet",
        "HabaneroConsulting.com - Profil de l'employé Modal"
      ]
    },
    "cornerstone": {
      "title": "Division scolaire publique SE Cornerstone - Système d'information financière",
      "desc": "<p>Habanero a développé une solution de reporting financier simplifiée et facile à utiliser pour le district scolaire public SE Cornerstone.</p><p>Une interface Web personnalisée avec des assistants en plusieurs étapes a remplacé les formulaires d'entrée complexes à page unique de Dynamics pour les actions les plus fréquemment utilisées.</p><p>La solution a été finaliste dans la catégorie Finance (ERP) des IMPACT Awards 2009 du Microsoft Partner Network.</p>",
      "circa": "Automne 2008",
      "images": [
        "Système budgétaire - Page d'accueil",
        "Système budgétaire - Nouvelle commande, étape 1",
        "Système budgétaire - Nouvelle commande, étape 2",
        "Système budgétaire - Dépôt"
      ]
    },
    "contosoriders": {
      "title": "Microsoft - Application rapide Contoso Riders",
      "desc": "<p>Microsoft a contacté Habanero afin de créer une application d'adhésion offrant une nouvelle expérience utilisateur et démontrant l'utilisation des services Windows Live pour la communauté des développeurs dans le cadre du projet Windows Live Quick Applications sur CodePlex.</p><p>Le résultat a été Contoso Riders, qui exploitait les services Windows Live suivants : authentification Web Windows Live ID, Windows Live Presence, contrôle de messagerie instantanée Windows Live Messenger, Windows Live Spaces, Silverlight Streaming, Bing Maps et Virtual Earth.</p><p>On m'a également demandé de présenter Contoso Riders lors de la conférence EnergizeIT de Microsoft.</p>",
      "circa": "Printemps 2008",
      "images": [
        "Contoso Riders - Maquette de la page d'accueil",
        "Contoso Riders - Maquette de la page Événements",
        "Contoso Riders - Intervention lors de la conférence EnergizeIT"
      ]
    },
    "bpDashboard": {
      "title": "Boston Pizza - Tableau de bord des franchisés",
      "desc": "<p>Le tableau de bord des franchisés était un écran interactif situé dans le hall du siège social de Boston Pizza à Richmond.</p><p>Les visiteurs pouvaient interagir avec l'écran et consulter des informations sur tous les restaurants Boston Pizza ou Boston's Gourmet Pizza en Amérique du Nord.</p><p>Le tableau de bord est un exemple de projet qui ne ciblait pas les navigateurs de bureau et qui utilisait les principes de conception d'interface utilisateur à 3 mètres et de jeu.</p><p>Le tableau de bord des franchisés original était contrôlé à l'aide d'une télécommande Nintendo Wii, les versions suivantes utilisant une souris gyroscopique.</p><p>Finalement, un port basé sur un navigateur a également été développé, accessible via l'intranet de Boston Pizza.</p>",
      "circa": "Hiver 2006",
      "images": [
        "Tableau de bord du franchisé - Écran d'accueil",
        "Tableau de bord du franchisé - Affichage cartographique",
        "Tableau de bord du franchisé - Vue liste",
        "Tableau de bord du franchisé - Informations sur le magasin"
      ]
    },
    "holidayPuppet": {
      "title": "Marionnette grise de Noël",
      "desc": "<p>La marionnette Grey Holiday était un message de vœux adressé aux clients et amis de Grey.</p><p>Ce qui avait commencé comme un projet de dernière minute avec des ressources, un temps et un budget extrêmement limités s'est transformé en un succès viral qui a été présenté sur del.icio.us et MetaFilter et a attiré des visiteurs venus d'aussi loin que la France, la Suède et la Russie.</p><p>La marionnette Holiday a remporté de nombreuses distinctions en matière de créativité et de design, notamment le Lotus Award 2005 de la meilleure autopromotion.</p>",
      "circa": "Hiver 2005",
      "images": [
        "Marionnette grise de Noël - Ne mangez pas les biscuits !",
        "Marionnette grise de Noël - Bonjour, Mme Robinson.",
        "Marionnette grise de Noël - Fat Fingers",
        "Marionnette grise de Noël - Découpage Casse-Noisette"
      ]
    },
    "quadrant": {
      "title": "Quadrant Homes - Site Web externe",
      "desc": "<p>Quadrant Homes, le plus grand constructeur immobilier de l'État de Washington, avait une mission simple : faire de QuadrantHomes.com le meilleur site web de constructeur immobilier aux États-Unis.</p><p>La refonte comprenait des outils interactifs basés sur Flash permettant aux nouveaux prospects et acheteurs de planifier leur nouvelle maison.</p><p>Le site a été salué par les employés de Quadrant, les clients et les agents immobiliers partenaires, ce qui a entraîné une augmentation des inscriptions sur la liste d'intérêt, des intentions d'achat et des chiffres de vente.</p>",
      "circa": "Automne 2005",
      "images": [
        "Quadrant Homes - Maquette de la page d'accueil",
        "Quadrant Homes - App « Construisez votre maison »",
        "Quadrant Homes - App « Construisez votre maison »",
        "Quadrant Homes - Page communautaire"
      ]
    },
    "thatchcay": {
      "title": "Thatch Cay",
      "desc": "<p>Située à seulement 800 mètres au large de la côte nord-est de Saint-Thomas, Thatch Cay est l'une des dernières îles vierges des Îles Vierges américaines à ne pas avoir été développée et à appartenir à des intérêts privés.</p><p>J'ai initialement été engagé par <em>dsire</em> et Loca Lola Design Team pour conseiller et aider au développement de ce site web basé sur Flash.</p><p>Lorsque le développeur Flash initial a quitté le projet à la dernière minute, j'ai pu prendre le relais et terminer le site dans les délais impartis, en atteignant tous les objectifs du projet.</p>",
      "circa": "Printemps 2004",
      "images": [
        "Thatch Cay - Histoire",
        "Thatch Cay - Vision",
        "Thatch Cay - Possibilités",
        "Thatch Cay - Emplacement"
      ]
    },
    "gi": {
      "title": "Granville Island - Site Web externe",
      "desc": "<p>Granville Island est l'une des destinations touristiques les plus réputées de Vancouver.</p><p>GranvilleIsland.com a été développé à partir du CMS grASP de Grey Vancouver et comprenait à la fois des interfaces HTML et Flash à haut débit, très avancées pour l'époque.</p><p>Le site Web Flash comprenait de nombreux éléments interactifs, des vidéos et des panoramas à 360°.</p>",
      "circa": "Été 2002",
      "images": [
        "Granville Island - Page d'accueil HTML",
        "Granville Island - Page d'accueil Flash",
        "Granville Island - Manger et boire",
        "Granville Island - Un endroit pour les enfants"
      ]
    },
    "ricksmith": {
      "title": "Rick Smith - Site portfolio",
      "desc": "<p>Le site portfolio de Rick Smith est un exemple de site web destiné aux artistes et photographes utilisant un CMS léger que j'ai développé.</p><p>À l'époque, il n'existait pas de solutions d'hébergement ASP et ASP.Net bon marché, j'ai donc développé cette solution avec PHP.</p><p>En raison de la petite taille de ces sites portfolio, j'ai pu expérimenter des effets et des transitions à l'aide de HTML et JavaScript plutôt que Flash.</p><p>Surpris que les effets DOM fonctionnent encore plus de dix ans plus tard, j'ai décidé de le remettre en ligne pour votre plus grand plaisir.</p>",
      "circa": "Printemps 2002",
      "images": [
        "Rick Smith - Page d'accueil",
        "Rick Smith - À propos",
        "Rick Smith - Je me bats pour revenir",
        "Rick Smith - Site Web Shaftebury Beer"
      ]
    },
    "grasp": {
      "title": "Grey Advertising - Système de gestion de contenu grASP",
      "desc": "<p>J'ai co-développé grASP, un système de gestion de contenu modulaire et extensible permettant à Grey Advertising Vancouver de produire et de déployer rapidement des solutions web attrayantes et dynamiques.</p>",
      "circa": "2001 - 2006",
      "images": [
        "Direction de la distribution des alcools de la Colombie-Britannique - 2000 à 2006",
        "Vitamines et suppléments SISU - Printemps 2004",
        "Inhaus Flooring - Été 2003",
        "Groupe Ledcor - Printemps 2003",
        "ADT Security Canada - Hiver 2002",
        "Île Granville - Été 2002"
      ]
    }
  },
  "portfolio": {
    "pageTitle": "Œuvre de Sing Chan",
    "pageDescription": "Sur cette page, vous trouverez une sélection de projets qui illustrent mes connaissances et mon expérience dans les domaines du développement d'applications web, de la conception, de l'ergonomie et de l'accessibilité.",
    "heading": "Sing Chan",
    "paragraphs": [
      "Sur cette page, vous trouverez une sélection de projets qui illustrent mes connaissances et mon expérience dans les domaines du développement d'applications web, de la conception, de l'ergonomie et de l'accessibilité. Je possède plus de 25 ans d'expérience dans le développement de logiciels, où je travaille avec des clients, des parties prenantes, des architectes de l'information, des concepteurs d'interactions, des développeurs et des responsables de l'assurance qualité afin de créer des solutions utilisables et visuellement attrayantes.",
      "J'ai participé à ces projets soit en tant que développeur principal de l'expérience utilisateur, chargé de la mise en œuvre des fonctionnalités personnalisées de l'interface utilisateur, des contrôles et de l'image de marque, soit en tant qu'architecte de l'expérience utilisateur, chargé de déterminer les approches de développement et d'aider les autres membres de l'équipe dans leurs tâches."
    ]
  }
}
